[{"model": "blog.blogpost", "pk": 1, "fields": {"slug": "chto-ispolzuyut-dlya-napisaniya-koda-v-nasa-i-spacex", "title": "Что используют для написания кода в НАСА и SpaceX?", "content": "Компании NASA и SpaceX используют для работы далеко не один язык программирования. Кроме того, они привлекают к созданию ПО для космических кораблей различные технологии и решения.\r\n\r\nВ 2000-е компания использовала язык Ассемблера для реализации кода для космических аппаратов. Это была вынужденная мера, т.к. применялись процессы с малой мощностью. Даже в 2006 году в космические корабли были установлены процессоры Intel 8085. При том что последние были выпущены еще в 1976 году.\r\n\r\nПопытка уйти от Ассемблер были, но не увенчались успехом. NASA создали свой язык программирования HAL, который пытались адаптировать под свои нужды. В 70-х даже было два варианта языка S – специально для кораблей и G – для центра управления. \r\n\r\nHAL минимизировали таким образом, чтобы в нем не было лишних конструкций. Это исключало возможность программных багов. Как результат – язык должен был стать надежным помощником, который не подведет астронавтов.", "image": "blog_images/space_x.webp", "views": 15, "is_published": true, "create_at": "2023-08-24T13:46:28.374Z"}}, {"model": "blog.blogpost", "pk": 2, "fields": {"slug": "igrovoj-dvizhok-unity-razbiraemsya-chto-k-chem", "title": "Игровой движок Unity: разбираемся что к чем!", "content": "Unity – это мощный и мегапопулярный многоплатформенный движок для создания компьютерных игр, а также интерактивных 2D и 3D-приложений. Он предоставляет разработчикам все необходимое для создания игр.\r\n\r\nИменно поэтому его используют специалисты по всему миру. А многие из них считают Unity номером 1 в мире разработки игр. Давайте подробнее поговорим о возможностях и принципах работы движка, а также познакомимся с примерами игр. \r\n\r\nПринцип работы\r\nПринцип работы в Unity представляет собой последовательность шагов, которые разработчики совершают при создании игры. Вот основные из них:\r\n\r\nСоздание сцены. Сцена – это пространство, где размещаются и взаимодействуют объекты игры. Их может быть несколько на каждом уровне. В Unity можно создавать и редактировать сцены, определять компоненты окружения, задавать освещение, камеры и пр.\r\nДобавление объектов. В Unity объекты – это основные строительные блоки игры. То есть необходимо добавлять различные объекты в сцену, такие как персонажи, предметы, препятствия и т.д. Также на этот этапе определяется их взаимодействие и поведение.\r\nСкрипты и кодирование. Вся работа с Unity осуществляется на языке C#. С помощью скриптов необходимо создавать поведение объектов и управлять игровой логикой. С помощью кода можно создавать уникальные функции, определить условия победы или поражения, обрабатывать пользовательский ввод и многое другое.\r\nТестирование и оптимизация. Когда игра создана, ее необходимо протестировать на различных устройствах и платформах. Тестирование помогает выявить ошибки, улучшить геймплей и оптимизировать производительность игры, чтобы она работала эффективно на различных устройствах.\r\nПубликация. Теперь игра публикуется на выбранных платформах, таких как компьютер, мобильные устройства, игровые приставки и т.д. Unity предоставляет инструменты для экспорта и публикации игры на различных платформах, что позволяет достичь широкой аудитории игроков.", "image": "blog_images/unity.webp", "views": 14, "is_published": true, "create_at": "2023-08-24T13:49:12.319Z"}}, {"model": "blog.blogpost", "pk": 3, "fields": {"slug": "instrumentyi-i-frejmvorki-dlya-ii-top-6", "title": "Инструменты и фреймворки для ИИ: ТОП-6", "content": "С популяризацией искусственного интеллекта произошел рост потребности в удобных инструментах и фреймворках. Важно, чтобы они облегчали и ускоряли процессы взаимодействия и работы на ИИ-проектами.\r\n\r\nДавайте разберем ТОП-6 наиболее популярных из них, предназначенных для работы на языке Python.\r\n\r\n#1. Scikit-learn\r\nПожалуй, это самая часто используемая библиотека машинного обучения. Она идеально подходит для работы и предоставляет широкий набор алгоритмов и инструментов для разработки моделей машинного обучения. Фреймворк включает в себя алгоритмы классификации, регрессии, кластеризации, а также модули для предобработки данных и оценки моделей. Это идеальная система для поддержки контролируемых и неконтролируемых алгоритмов обучения. \r\n\r\n\r\n#2. TensorFlow\r\nTensorFlow – это открытая платформа для разработки искусственного интеллекта, разработанная компанией Google. Ее выпустили под лицензией Apache License 2.0. в 2015 году. \r\nОн предоставляет гибкий и мощный фреймворк для создания и обучения моделей машинного обучения, основанных на нейронных сетях. TensorFlow обеспечивает высокую производительность и поддерживает различные платформы, включая CPU и GPU. Все это доступно благодаря системе многослойных узлов. \r\n\r\n\r\n#3. Pandas\r\nУдобная библиотек, предназначенная для анализа и обработки данных. Она предоставляет высокоуровневые структуры данных, такие как DataFrame, и функции для эффективной манипуляции и анализа данных. При этом можно работать как с реляционными, так и с маркированными данными.", "image": "", "views": 26, "is_published": true, "create_at": "2023-08-24T13:50:25.632Z"}}]